app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG') ORDER BY titleasc
---
  def index
    @DB_TITLE = 'title'
    @DB_RELEASE_DATE = 'release_date'
    @all_ratings = Movie.all_ratings
@paramStr = ""
#=begin
@paramStr = params[:ratings]
    doRedirect = false

    if params[:sort] == nil
      doRedirect = session[:sort] != nil
        #@sortStr = "sort=#{session[:sort]}"
    else
      session[:sort] = params[:sort]
    end

    if params[:ratings] == nil
      doRedirect = true
=begin
      @ratingsStr = ""
      if session[:ratings] != nil
        session[:ratings].each do |r,v|
          @ratingsStr += "&" if @ratingsStr != ""
          @ratingsStr += "ratings[#{r}]=1"
        end
      else
        @all_ratings.each do |r|

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
      ratings = params[:ratings].keys if params[:ratings] != nil
      @ratingSel = ratings || []
      if ratings
        @movies = Movie.find(:all, :order => sortOrderStr , :conditions => {:rating => ratings })

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "12"]]
UPDATE "movies" SET "title" = 'Bcd.x', "release_date" = '2009-12-01 00:00:00.000000', "updated_at" = '2014-12-01 19:58:36.660060' WHERE "movies"."id" = 12
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])